# Найти сумму чисел списка стоящих на нечетной позиции

list = [1, 2, 3, 4,]
b = [i for i in list if i % 2 !=0]
print(sum(b))
